{"current_page":2,"limit":20,"next_page":3,"previous_page":1,"results":[{"id":"1T0gqOZT0g","joke":"I thought my wife was joking when she said she'd leave me if I didn't stop signing \"I'm A Believer\"... Then I saw her face."},{"id":"1TfNRKexAd","joke":"I’m only familiar with 25 letters in the English language. I don’t know why."},{"id":"1gyI6EIRKBd","joke":"What do you call two barracuda fish?  A Pairacuda!"},{"id":"1gyskqz51ob","joke":"What did the father tomato say to the baby tomato whilst on a family walk? Ketchup."},{"id":"1oGYLu4T7Ed","joke":"Why is Peter Pan always flying? Because he Neverlands."},{"id":"1oOfFlOfaxc","joke":"What do you do on a remote island? Try and find the TV island it belongs to."},{"id":"1wkqrcNCljb","joke":"Did you know that protons have mass? I didn't even know they were catholic."},{"id":"2118E69prc","joke":"Dad I’m hungry’ … ‘Hi hungry I’m dad"},{"id":"218xkq49prc","joke":"I was fired from the keyboard factory yesterday.  I wasn't putting in enough shifts."},{"id":"21DQnbaaxc","joke":"Whoever invented the knock-knock joke should get a no bell prize."},{"id":"29ElG6p49pb","joke":"Wife: Honey I’m pregnant.\r\n\r\nMe: Well…. what do we do now?\r\n\r\nWife: Well, I guess we should go to a baby doctor.\r\n\r\nMe: Hm.. I think I’d be a lot more comfortable going to an adult doctor."},{"id":"2TnrHtcNuc","joke":"When will the little snake arrive? I don't know but he won't be long..."},{"id":"2TvX0wX89h","joke":"Why was Pavlov's beard so soft?  Because he conditioned it."},{"id":"2gFIBX82Etc","joke":"Do I enjoy making courthouse puns? Guilty"},{"id":"2gaMZLBszsc","joke":"Why did the kid throw the clock out the window? He wanted to see time fly!"},{"id":"2giGYLeiGe","joke":"Hear about the new restaurant called Karma? There’s no menu: You get what you deserve."},{"id":"2gii3LeN7Ed","joke":"Why couldn't the kid see the pirate movie? Because it was rated arrr!"},{"id":"2wP711DAdFd","joke":"Man, I really love my furniture... me and my recliner go way back."},{"id":"2wkykjyIYDd","joke":"What did the traffic light say to the car as it passed? \"Don't look I'm changing!\""},{"id":"31wHeNJB5ob","joke":"My son is studying to be a surgeon, I just hope he makes the cut."}],"search_term":"","status":200,"total_jokes":649,"total_pages":33}
