{
    "current_page": 3,
    "limit": 20,
    "next_page": 1,
    "previous_page": 2,
    "results": [
        {
            "id": "39Etc2orc",
            "joke": "Why did the man run around his bed? Because he was trying to catch up on his sleep!"
        },
        {
            "id": "3E6MuHtH6h",
            "joke": "What did one wall say to the other wall? I'll meet you at the corner!"
        },
        {
            "id": "3E6U8UKmbFd",
            "joke": "Sometimes I tuck my knees into my chest and lean forward.  That’s just how I roll."
        },
        {
            "id": "3El3TCYDYob",
            "joke": "Conjunctivitis.com – now that’s a site for sore eyes."
        },
        {
            "id": "3LRCIJY82wc",
            "joke": "How many South Americans does it take to change a lightbulb? A Brazilian"
        },
        {
            "id": "3LmyXvsPfqc",
            "joke": "I don't trust stairs. They're always up to something."
        },
        {
            "id": "3gibFB5Muzd",
            "joke": "Why was the robot angry? Because someone kept pressing his buttons!"
        },
        {
            "id": "3oG6UvX82g",
            "joke": "Which is the fastest growing city in the world? Dublin'"
        },
        {
            "id": "3w5wAIRZTnb",
            "joke": "A police officer caught two kids playing with a firework and a car battery. He charged one and let the other one off."
        },
        {
            "id": "41LeN7EImjb",
            "joke": "What is the difference between ignorance and apathy?\r\n\r\nI don't know and I don't care."
        },
        {
            "id": "49xPmW82g",
            "joke": "I went to a Foo Fighters Concert once... It was Everlong..."
        },
        {
            "id": "4EBsPZvP7h",
            "joke": "Some people eat light bulbs. They say it's a nice light snack."
        },
        {
            "id": "4ElyszXDdxc",
            "joke": "I went to the store to pick up eight cans of sprite... when I got home I realized I'd only picked seven up"
        },
        {
            "id": "4MmjbFlbah",
            "joke": "I cut my finger chopping cheese, but I think that I may have grater problems."
        },
        {
            "id": "4wHB51ws4Ed",
            "joke": "Last night me and my girlfriend watched three DVDs back to back. Luckily I was the one facing the TV."
        },
        {
            "id": "4wciyk3EBAd",
            "joke": "I got a reversible jacket for Christmas, I can't wait to see how it turns out."
        },
        {
            "id": "51DAA5Tfaxc",
            "joke": "What did Romans use to cut pizza before the rolling cutter was invented? Lil Caesars"
        },
        {
            "id": "5M7hF6EItzd",
            "joke": "My pet mouse 'Elvis' died last night. He was caught in a trap.."
        },
        {
            "id": "5T08U8M79pb",
            "joke": "Never take advice from electrons. They are always negative."
        },
        {
            "id": "5TS7pbxcpb",
            "joke": "Why are oranges the smartest fruit? Because they are made to concentrate. "
        }
    ],
    "search_term": "",
    "status": 200,
    "total_jokes": 649,
    "total_pages": 33
}
